posts/2013-06-05-guildwars.org






#+date: <2013-06-05 00:00>
#+title: Guildwars - Gaming - Personal 

Today, I found myself traversing centaur camps whilst trying to complete
the Arathi Hinterlands. I was on my way to the skill point at the far
east of the map, running my way past hordes of enemies, using my
speed-up abilities and shield spells. Progress was slow, and after about
a half hour, I had had enough. I turned around and started to head back,
only to be greeted by a group of about a dozen players who were
efficiently making a path through the centaur camps. I had stumbled upon
a server event that was going the same way I was. Sticking with them for
the next half hour made the skill point reachable, as there were others
trying to acquire that achievement also.

Guildwars2 rocks.
