guildwars.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-26 Tue 23:28 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guildwars</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="Guildwars">
<meta property="og:description" content="">
<meta property="description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/guildwars.html">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='./assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>Up: arst wow</a>
</div>

<div style="float: right">
    <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2013-06-05-guildwars.org">Last edit: <2019-02-24></a>
</div>

<p>
<h1 class=title>Guildwars</h1>
</p>


<hr>

<p>
Today, I found myself traversing centaur camps whilst trying to complete
the Arathi Hinterlands. I was on my way to the skill point at the far
east of the map, running my way past hordes of enemies, using my
speed-up abilities and shield spells. Progress was slow, and after about
a half hour, I had had enough. I turned around and started to head back,
only to be greeted by a group of about a dozen players who were
efficiently making a path through the centaur camps. I had stumbled upon
a server event that was going the same way I was. Sticking with them for
the next half hour made the skill point reachable, as there were others
trying to acquire that achievement also.
</p>

<p>
Guildwars2 rocks.
</p>


<p>
<div class='flair'></div>
</p>

<div class='footer-left'>
    <a href='/index.html'>arst wow</a>
</div>

<p>
<div class=footer-center>type: post</div>
</p>

<div class="footer-right">
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2013-06-05-guildwars.org">Page Markup</a>
</div>
</div>
</body>
</html>
